#+TITLE: Java Programming in Emacs

Note that this comes from [[https://github.com/neppramod/java_emacs/edit/master/emacs-configuration.org][here]]. Should get a nice emacs config for
java then.
 
* Add Ripgrep for searching as you usually do via grep on unix systems

#+begin_src emacs-lisp 
(use-package ripgrep
  :ensure t
  :defer t) ;; recall to download it trough MELPA at first
#+end_src 

#+RESULTS:
  
  #+BEGIN_SRC emacs-lisp
(add-to-list 'exec-path "C:/Users/MARCO.HASSAN/Desktop/programs_executables/ripgrep-13.0.0-x86_64-pc-windows-gnu")
  #+END_SRC

  #+RESULTS:
  | C:/Users/MARCO.HASSAN/Desktop/programs_executables/ripgrep-13.0.0-x86_64-pc-windows-gnu | C:/Users/MARCO.HASSAN/Desktop/programs_executables/ripgrep-globset-0.4.8 | c:/WINDOWS/system32 | C:/WINDOWS | C:/WINDOWS/System32/Wbem | C:/WINDOWS/System32/WindowsPowerShell/v1.0/ | C:/WINDOWS/System32/OpenSSH/ | C:/Program Files/1E/Client/Extensibility/NomadBranch | C:/Dev/ispell/ispell/bin | C:/Users/MARCO.HASSAN/OneDrive - Zurich Insurance/Emacs/bin | C:/JavaServer/jdk-11.0.12+7/bin | C:/Users/MARCO.HASSAN/Desktop/programs_executables/python | C:/Users/MARCO.HASSAN/Desktop/programs_executables/python/Scripts | C:/Users/MARCO.HASSAN/Desktop/programs_executables/python/Lib/site-packages | C:/Users/MARCO.HASSAN/AppData/Local/Microsoft/WindowsApps | C:/Users/MARCO.HASSAN/Desktop/programs_executables/awk/bin | . | c:/Users/MARCO.HASSAN/OneDrive - Zurich Insurance/Emacs/libexec/emacs/27.2/x86_64-w64-mingw32 |


  
* Maven
  
   #+begin_src emacs-lisp 
   (setq magit-git-executable "C:/Users/MARCO.HASSAN/Desktop/programs_executables/apache-maven-3.8.2/bin")
   #+end_src 

   #+RESULTS:
   : C:/Users/MARCO.HASSAN/Desktop/programs_executables/apache-maven-3.8.2/bin


** Install LSP Package

   Let's install the main package for lsp. Here we will integrate lsp
   with which-key. This way, when we type the prefix key ~C-c l~ we get
   additional help for compliting the command.   
   

   #+begin_src emacs-lisp
     (use-package lsp-mode
       :ensure t
       :hook (
	      (lsp-mode . lsp-enable-which-key-integration)
	      (java-mode . lsp-deferred)
	      )
       :init (setq 
	      lsp-keymap-prefix "C-c C-x l"              ; this is for which-key integration documentation, need to use lsp-mode-map
	      lsp-enable-file-watchers nil
	      read-process-output-max (* 1024 1024)  ; 1 mb
	      lsp-completion-provider :capf
	      lsp-idle-delay 0.900
	      )
       :config 
       (setq lsp-intelephense-multi-root nil) ; don't scan unnecessary projects
       (with-eval-after-load 'lsp-intelephense
	 (setf (lsp--client-multi-root (gethash 'iph lsp-clients)) nil))
       (define-key lsp-mode-map (kbd "C-c C-x l") lsp-command-map)
       )
   #+end_src

   #+RESULTS:
   | lsp-deferred |

   You can start LSP server in a java project by using ~C-c C-x l s
   s~. Once you type ~C-c C-x l~ ~which-key~ package should guide you
   through rest of the options. In above setting I have added some
   memory management settings as suggested in [[https://emacs-lsp.github.io/lsp-mode/page/performance/][this guide]]. Change them
   to higher numbers, if you find *lsp-mode* sluggish in your
   computer.

   #+begin_src emacs-lisp 
(setq lsp-enable-symbol-highlighting nil)
   #+end_src 

   #+RESULTS:


** Dap for debugging on Remote Server

   This is what I need to do as the Java applications I am working on are working on remote servers.

   In order to do that you have to add the following specific parameters.

   #+begin_src emacs-lisp 
	 (dap-register-debug-template
	 "localhost:8000"
	 (list :type "java"
		   :request "attach"
		   :hostName "localhost"
		   :port 8000))
   #+end_src 

   #+RESULTS:
   | localhost:8000                          | :name | localhost:8000         | :type    | java           | :request | attach | :hostName | localhost | :port | 8000      |              |             |              |           |             |        |              |     |              |     |              |     |            |     |
   | Java Attach                             | :name | Java Attach            | :type    | java           | :request | attach | :hostName | localhost | :port | nil       |              |             |              |           |             |        |              |     |              |     |              |     |            |     |
   | Java Run Configuration (compile/attach) | :type | java                   | :request | compile_attach | :args    |        | :cwd      | nil       | :host | localhost | :request     | launch      | :modulePaths | []        | :classPaths | nil    | :name        | Run | :projectName | nil | :mainClass   | nil |            |     |
   | Java Run Configuration                  | :name | Java Run Configuration | :type    | java           | :request | launch | :args     |           | :cwd  | nil       | :stopOnEntry | :json-false | :host        | localhost | :request    | launch | :modulePaths | []  | :classPaths  | nil | :projectName | nil | :mainClass | nil |
   
